### Handling Missing Data

In [5]:
import numpy as np
import pandas as pd

In [7]:
string_data = pd.Series(['artwork', 'history',np.nan, 'painting'])
string_data

0     artwork
1     history
2         NaN
3    painting
dtype: object

In [10]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
# use python builtin None data type
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
string_data.fillna(method = 'bfill')

0     history
1     history
2    painting
3    painting
dtype: object

In [14]:
string_data.fillna(method = 'ffill')

0        None
1     history
2     history
3    painting
dtype: object

In [15]:
string_data.dropna()

1     history
3    painting
dtype: object

### Filtering Out Missing Data

In [17]:
from numpy import nan as NA
data = pd.Series([1,NA,NA,4,4,NA,8,9])
data

0    1.0
1    NaN
2    NaN
3    4.0
4    4.0
5    NaN
6    8.0
7    9.0
dtype: float64

In [19]:
data.dropna() # data[data.notnull()]

0    1.0
3    4.0
4    4.0
6    8.0
7    9.0
dtype: float64

In [21]:
data = pd.DataFrame([[1,3,NA,6],
                     [3,4,5,NA],
                     [3,8,4,NA],
                     [2,4,NA,1]])
data

   0  1    2    3
0  1  3  NaN  6.0
1  3  4  5.0  NaN
2  3  8  4.0  NaN
3  2  4  NaN  1.0

In [26]:
cleaned = data.dropna()
cleaned

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [27]:
data.dropna(how='all')

   0  1    2    3
0  1  3  NaN  6.0
1  3  4  5.0  NaN
2  3  8  4.0  NaN
3  2  4  NaN  1.0

In [30]:
data[1] = NA
data

   0   1    2    3
0  1 NaN  NaN  6.0
1  3 NaN  5.0  NaN
2  3 NaN  4.0  NaN
3  2 NaN  NaN  1.0

In [32]:
df = pd.DataFrame(np.random.randn(5,6))
df

          0         1         2         3         4         5
0  0.431739 -0.108738 -0.414773  0.058992 -0.786360 -0.228763
1 -1.069439 -0.981115  0.387910 -0.611921 -1.080016 -0.601131
2 -0.911277 -0.260011  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238 -0.721225 -1.397620 -0.406672
4 -0.337158  0.348176  0.215764  0.034819 -1.026264  0.106460

In [71]:
df.iloc[:3,1] = NA
df.iloc[:2,4] = NA
df.iloc[3:,3] = NA
df

          0         1         2         3         4         5
0  0.431739       NaN -0.414773  0.058992       NaN -0.228763
1 -1.069439       NaN  0.387910 -0.611921       NaN -0.601131
2 -0.911277       NaN  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238       NaN -1.397620 -0.406672
4 -0.337158  0.348176  0.215764       NaN -1.026264  0.106460

In [72]:
df.dropna(thresh=1)

          0         1         2         3         4         5
0  0.431739       NaN -0.414773  0.058992       NaN -0.228763
1 -1.069439       NaN  0.387910 -0.611921       NaN -0.601131
2 -0.911277       NaN  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238       NaN -1.397620 -0.406672
4 -0.337158  0.348176  0.215764       NaN -1.026264  0.106460

In [76]:
df.fillna(0)

          0         1         2         3         4         5
0  0.431739  0.345000 -0.414773  0.058992  0.376000 -0.228763
1 -1.069439  0.345000  0.387910 -0.611921  0.376000 -0.601131
2 -0.911277  0.345000  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238  0.387000 -1.397620 -0.406672
4 -0.337158  0.348176  0.215764  0.387000 -1.026264  0.106460

In [73]:
_ = df.fillna({1:.345, 2:.353, 3:.387, 4:.376}, inplace=True)
df

          0         1         2         3         4         5
0  0.431739  0.345000 -0.414773  0.058992  0.376000 -0.228763
1 -1.069439  0.345000  0.387910 -0.611921  0.376000 -0.601131
2 -0.911277  0.345000  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238  0.387000 -1.397620 -0.406672
4 -0.337158  0.348176  0.215764  0.387000 -1.026264  0.106460

In [78]:
_ = df.fillna(0, inplace=True)
df

          0         1         2         3         4         5
0  0.431739  0.345000 -0.414773  0.058992  0.376000 -0.228763
1 -1.069439  0.345000  0.387910 -0.611921  0.376000 -0.601131
2 -0.911277  0.345000  1.007130  0.702611  1.037829 -0.656633
3  1.322491 -0.690280  0.287238  0.387000 -1.397620 -0.406672
4 -0.337158  0.348176  0.215764  0.387000 -1.026264  0.106460

In [83]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[1:3, 2] = NA
df.iloc[:2, 1] = NA
df

          0         1         2
0 -0.671264       NaN  0.329175
1 -1.236203       NaN       NaN
2  0.526442  0.584473       NaN
3  0.129916 -1.041014  0.794533
4  2.470534 -1.631613  0.819016
5 -1.366015  0.193015  0.279929

In [85]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.671264       NaN  0.329175
1 -1.236203       NaN  0.329175
2  0.526442  0.584473  0.329175
3  0.129916 -1.041014  0.794533
4  2.470534 -1.631613  0.819016
5 -1.366015  0.193015  0.279929

In [86]:
df.fillna(method = 'bfill')

          0         1         2
0 -0.671264  0.584473  0.329175
1 -1.236203  0.584473  0.794533
2  0.526442  0.584473  0.794533
3  0.129916 -1.041014  0.794533
4  2.470534 -1.631613  0.819016
5 -1.366015  0.193015  0.279929

In [87]:
df.fillna(method = 'bfill', limit = 1)

          0         1         2
0 -0.671264       NaN  0.329175
1 -1.236203  0.584473       NaN
2  0.526442  0.584473  0.794533
3  0.129916 -1.041014  0.794533
4  2.470534 -1.631613  0.819016
5 -1.366015  0.193015  0.279929

In [91]:
df.fillna(df.mean())
# here means of the columns

          0         1         2
0 -0.671264 -0.473785  0.329175
1 -1.236203 -0.473785  0.555663
2  0.526442  0.584473  0.555663
3  0.129916 -1.041014  0.794533
4  2.470534 -1.631613  0.819016
5 -1.366015  0.193015  0.279929

In [90]:
df[1].mean()

-0.4737846563956412

## Data Transformation

### Removing Duplicates

In [97]:
data = pd.DataFrame({'k1':['one','two','one']*3 + ['two'],
                    'k2': [1,3,4,2,2,3,3,3,1,4]})
data

    k1  k2
0  one   1
1  two   3
2  one   4
3  one   2
4  two   2
5  one   3
6  one   3
7  two   3
8  one   1
9  two   4

In [99]:
data.duplicated()
# returns if rows are duplicated

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9    False
dtype: bool

In [101]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   3
2  one   4
3  one   2
4  two   2
5  one   3
9  two   4

In [103]:
data  = pd.DataFrame({'food': ['rice','wheat','barley'],
                     'weight': [3,4,5,]})
data

     food  weight
0    rice       3
1   wheat       4
2  barley       5

In [105]:
data['price'] = [100,123,132]
data

     food  weight  price
0    rice       3    100
1   wheat       4    123
2  barley       5    132

### Replacing Value

In [109]:
data = pd.DataFrame([3,2,3,1,2,4,4,1,2,3])
data.replace(3, np.nan)

     0
0  NaN
1  2.0
2  NaN
3  1.0
4  2.0
5  4.0
6  4.0
7  1.0
8  2.0
9  NaN

In [111]:
data.replace([2,3], np.nan)

     0
0  NaN
1  NaN
2  NaN
3  1.0
4  NaN
5  4.0
6  4.0
7  1.0
8  NaN
9  NaN

In [112]:
data.replace([2,3], [np.nan,7])

     0
0  7.0
1  NaN
2  7.0
3  1.0
4  NaN
5  4.0
6  4.0
7  1.0
8  NaN
9  7.0

In [113]:
data.replace({2: np.nan, 3:7})

     0
0  7.0
1  NaN
2  7.0
3  1.0
4  NaN
5  4.0
6  4.0
7  1.0
8  NaN
9  7.0

In [141]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Dhaka','Sylhet','Rajshahi'],
                   columns = ['January','February','March','April'])
data

          January  February  March  April
Dhaka           0         1      2      3
Sylhet          4         5      6      7
Rajshahi        8         9     10     11

In [142]:
transform  = lambda x: x[0:3].upper()
transform

In [143]:
data.index = data.index.map(transform)
data

     January  February  March  April
DHA        0         1      2      3
SYL        4         5      6      7
RAJ        8         9     10     11

In [147]:
data.rename(index=str.upper, columns = str.upper)

     JANUARY  FEBRUARY  MARCH  APRIL
DHA        0         1      2      3
SYL        4         5      6      7
RAJ        8         9     10     11

In [148]:
data.index

Index(['DHA', 'SYL', 'RAJ'], dtype='object')

In [150]:
data.rename(index={'DHA':'KHU'}, columns={'April':"APR"},inplace=True)
data

     January  February  March  APR
KHU        0         1      2    3
SYL        4         5      6    7
RAJ        8         9     10   11